## [liquibase-docs-prod](https://liquibase.app.spacelift.io/stack/liquibase-docs-prod/run/01J3GWQQR9P7NYWV0Y5AA28KTE) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/tools-integrations/liquibase-hub/release-notes.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/release-notes.html]
aws_s3_object.redirects["/commands/execute-sql.html"]: Refreshing state... [id=/commands/execute-sql.html]
aws_s3_object.redirects["/change-types/community/update.html"]: Refreshing state... [id=/change-types/community/update.html]
aws_s3_object.redirects["/tools-integrations/ant/home.html"]: Refreshing state... [id=/tools-integrations/ant/home.html]
aws_s3_object.redirects["/commands/config-ref/objectquotingstrategy.html"]: Refreshing state... [id=/commands/config-ref/objectquotingstrategy.html]
aws_s3_object.redirects["/concepts/advanced/home.html"]: Refreshing state... [id=/concepts/advanced/home.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/sqlite.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/sqlite.html]
aws_s3_object.redirects["/start/install/tutorials/oracle.html"]: Refreshing state... [id=/start/install/tutorials/oracle.html]
aws_s3_object.redirects["/commands/maintenance/release-locks.html"]: Refreshing state... [id=/commands/maintenance/release-locks.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.2.html]
aws_s3_object.redirects["/install/tutorials/maxdb.html"]: Refreshing state... [id=/install/tutorials/maxdb.html]
aws_s3_object.redirects["/start/install/tutorials/bigquery.html"]: Refreshing state... [id=/start/install/tutorials/bigquery.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-the-liquibase-percona-toolkit-extension.html"]: Refreshing state... [id=/workflows/liquibase-community/using-the-liquibase-percona-toolkit-extension.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-json-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-json-macos.html]
aws_s3_object.redirects["/concepts/basic/databasechangelog-table.html"]: Refreshing state... [id=/concepts/basic/databasechangelog-table.html]
aws_s3_object.redirects["/commands/config-ref/generate-changeset-created-values.html"]: Refreshing state... [id=/commands/config-ref/generate-changeset-created-values.html]
aws_s3_object.redirects["/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html"]: Refreshing state... [id=/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html]
aws_s3_object.redirects["/commands/quality-checks/quality-checks-list.html"]: Refreshing state... [id=/commands/quality-checks/quality-checks-list.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-clear-checksums.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-clear-checksums.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-db-doc.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-db-doc.html]
aws_s3_object.redirects["/commands/quality-checks/checks/primary-key-on-create-table.html"]: Refreshing state... [id=/commands/quality-checks/checks/primary-key-on-create-table.html]
aws_s3_object.redirects["/install/tutorials/sap-hana.html"]: Refreshing state... [id=/install/tutorials/sap-hana.html]
aws_s3_object.redirects["/tools-integrations/labs/variables.html"]: Refreshing state... [id=/tools-integrations/labs/variables.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-tablespace-name.html"]: Refreshing state... [id=/concepts/advanced/liquibase-tablespace-name.html]
aws_s3_object.redirects["/commands/config-ref/output-file-encoding.html"]: Refreshing state... [id=/commands/config-ref/output-file-encoding.html]
aws_s3_object.redirects["/commands/community/marknextchangesetran.html"]: Refreshing state... [id=/commands/community/marknextchangesetran.html]
aws_s3_object.redirects["/concepts/advanced/changelog-lock-poll-rate.html"]: Refreshing state... [id=/concepts/advanced/changelog-lock-poll-rate.html]
aws_s3_object.redirects["/change-types/community/alter-sequence.html"]: Refreshing state... [id=/change-types/community/alter-sequence.html]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-databases.html]
aws_s3_object.redirects["/change-types/community/delete.html"]: Refreshing state... [id=/change-types/community/delete.html]
aws_s3_object.redirects["/commands/updatesql.html"]: Refreshing state... [id=/commands/updatesql.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/json-object.html"]: Refreshing state... [id=/commands/quality-checks/concepts/json-object.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/home.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/home.html]
aws_s3_object.redirects["/commands/community/rollbacktodate.html"]: Refreshing state... [id=/commands/community/rollbacktodate.html]
aws_s3_object.redirects["/install/tutorials/oracle-atp-db.html"]: Refreshing state... [id=/install/tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/start/install/tutorials/cockroachdb.html"]: Refreshing state... [id=/start/install/tutorials/cockroachdb.html]
aws_s3_object.redirects["/workflows/liquibase-community/modify-sql.html"]: Refreshing state... [id=/workflows/liquibase-community/modify-sql.html]
aws_s3_object.redirects["/commands/community/update.html"]: Refreshing state... [id=/commands/community/update.html]
aws_s3_object.redirects["/concepts/changelogs/runwith.html"]: Refreshing state... [id=/concepts/changelogs/runwith.html]
aws_s3_object.redirects["/commands/maintenance/unexpected-changesets.html"]: Refreshing state... [id=/commands/maintenance/unexpected-changesets.html]
aws_s3_object.redirects["/commands/quality-checks/working-with-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/working-with-quality-checks.html]
aws_s3_object.redirects["/commands/community/snapshotreference.html"]: Refreshing state... [id=/commands/community/snapshotreference.html]
aws_s3_object.redirects["/start/tutorials/neo4j.html"]: Refreshing state... [id=/start/tutorials/neo4j.html]
aws_s3_object.redirects["/install/tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/install/tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/concepts/installation/setup-github-actions-workflow.html"]: Refreshing state... [id=/concepts/installation/setup-github-actions-workflow.html]
aws_s3_object.redirects["/change-types/pro/create-trigger.html"]: Refreshing state... [id=/change-types/pro/create-trigger.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer.html]
aws_s3_object.redirects["/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html"]: Refreshing state... [id=/start/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html]
aws_s3_object.redirects["/change-types/community/load-data.html"]: Refreshing state... [id=/change-types/community/load-data.html]
aws_s3_object.redirects["/install/tutorials/impala-hive.html"]: Refreshing state... [id=/install/tutorials/impala-hive.html]
aws_s3_object.redirects["/install/tutorials/db2-luw.html"]: Refreshing state... [id=/install/tutorials/db2-luw.html]
aws_s3_object.redirects["/commands/quality-checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/table-comment-check.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/pipelines.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/pipelines.html]
aws_s3_object.redirects["/concepts/advanced/include-system-classpath-parameter.html"]: Refreshing state... [id=/concepts/advanced/include-system-classpath-parameter.html]
aws_s3_object.redirects["/feature-flags/readmes/Flagsmith Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/Flagsmith Feature Flags Extension_1.html]
aws_s3_object.redirects["/change-types/community/add-primary-key.html"]: Refreshing state... [id=/change-types/community/add-primary-key.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/tagdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/tagdatabase.html]
aws_s3_object.redirects["/install/tutorials/oracle.html"]: Refreshing state... [id=/install/tutorials/oracle.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/tools-integrations/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/start/getting-started-liquibase-yaml-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-yaml-linux.html]
aws_s3_object.redirects["/install/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/install/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.19.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.19.0.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-yaml-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-yaml-on-windows.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/db2onz.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/db2onz.html]
aws_s3_object.redirects["/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html"]: Refreshing state... [id=/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/maxdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/maxdb.html]
aws_s3_object.redirects["/commands/help.html"]: Refreshing state... [id=/commands/help.html]
aws_s3_object.redirects["/feature-flags/readmes/Liquibase Custom Hosts Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Liquibase Custom Hosts Extension.html]
aws_s3_object.redirects["/commands/changelogsyncsql.html"]: Refreshing state... [id=/commands/changelogsyncsql.html]
aws_s3_object.redirects["/2014/11/popular-topics.html"]: Refreshing state... [id=/2014/11/popular-topics.html]
aws_s3_object.redirects["/install/tutorials/cassandra.html"]: Refreshing state... [id=/install/tutorials/cassandra.html]
aws_s3_object.redirects["/concepts/changelogs/include.html"]: Refreshing state... [id=/concepts/changelogs/include.html]
aws_s3_object.redirects["/commands/community/changelogsyncsql.html"]: Refreshing state... [id=/commands/community/changelogsyncsql.html]
aws_s3_object.redirects["/start/tutorials/yugabytedb.html"]: Refreshing state... [id=/start/tutorials/yugabytedb.html]
aws_s3_object.redirects["/commands/quality-checks/checks/require-chaneset-dis-uuid.html"]: Refreshing state... [id=/commands/quality-checks/checks/require-chaneset-dis-uuid.html]
aws_s3_object.redirects["/commands/marknextchangesetransql.html"]: Refreshing state... [id=/commands/marknextchangesetransql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.17.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.17.1.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-yaml-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-yaml-windows.html]
aws_s3_object.redirects["/install/liquibase-requirements.html"]: Refreshing state... [id=/install/liquibase-requirements.html]
aws_s3_object.redirects["/start/tutorials/informix.html"]: Refreshing state... [id=/start/tutorials/informix.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-json-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-json-on-linux-macos.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.4.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.4.2.html]
aws_s3_object.redirects["/change-types/community/drop-unique-constraint.html"]: Refreshing state... [id=/change-types/community/drop-unique-constraint.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/yugabytedb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/yugabytedb.html]
aws_s3_object.redirects["/commands/community/tagexists.html"]: Refreshing state... [id=/commands/community/tagexists.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync-to-tag.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync-to-tag.html]
aws_s3_object.redirects["/commands/quality-checks/checks/pro-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/checks/pro-quality-checks.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-xml-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-xml-windows.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/projects.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/projects.html]
aws_s3_object.redirects["/commands/status-verbose.html"]: Refreshing state... [id=/commands/status-verbose.html]
aws_s3_object.redirects["/operation-reports"]: Refreshing state... [id=/operation-reports]
aws_s3_object.redirects["/workflows/database-setup-tutorials/tutorial-using-oracle.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/tutorial-using-oracle.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-syncHub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-syncHub.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mssql-integrated-security-kerberos-authentication.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mssql-integrated-security-kerberos-authentication.html]
aws_s3_object.redirects["/release-notes/home.html"]: Refreshing state... [id=/release-notes/home.html]
aws_s3_object.redirects["/feature-flags/readmes/Example.html"]: Refreshing state... [id=/feature-flags/readmes/Example.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-deactivatechangelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-deactivatechangelog.html]
aws_s3_object.redirects["/commands/community/releaselocks.html"]: Refreshing state... [id=/commands/community/releaselocks.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-2.0-upgrade-guide.html]
aws_s3_object.redirects["/environment-variables"]: Refreshing state... [id=/environment-variables]
aws_s3_object.redirects["/commands/diff/diff-changelog.html"]: Refreshing state... [id=/commands/diff/diff-changelog.html]
aws_s3_object.redirects["/commands/quality-checks/checks/warn-on-use-database.html"]: Refreshing state... [id=/commands/quality-checks/checks/warn-on-use-database.html]
aws_s3_object.redirects["/concepts/basic/other-formats.html"]: Refreshing state... [id=/concepts/basic/other-formats.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-synchub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-synchub.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/flagr-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/flagr-feature-flags-extension.html]
aws_s3_object.redirects["/change-types/pro/drop-package-body.html"]: Refreshing state... [id=/change-types/pro/drop-package-body.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql.html]
aws_s3_object.redirects["/commands/community/listlocks.html"]: Refreshing state... [id=/commands/community/listlocks.html]
aws_s3_object.redirects["/commands/maintenance/changelog-sync-sql.html"]: Refreshing state... [id=/commands/maintenance/changelog-sync-sql.html]
aws_s3_object.redirects["/start/tutorials/teradata.html"]: Refreshing state... [id=/start/tutorials/teradata.html]
aws_s3_object.redirects["/start/tutorials/firebird.html"]: Refreshing state... [id=/start/tutorials/firebird.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/db2-luw.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/db2-luw.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changeset-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changeset-comment-check.html]
aws_s3_object.redirects["/commands/hub/deactivate-changelog.html"]: Refreshing state... [id=/commands/hub/deactivate-changelog.html]
aws_s3_object.redirects["/concepts/json-format.html"]: Refreshing state... [id=/concepts/json-format.html]
aws_s3_object.redirects["/commands/config-ref/database-class.html"]: Refreshing state... [id=/commands/config-ref/database-class.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/impala-hive.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/impala-hive.html]
aws_s3_object.redirects["/concepts/changelogs/changelog-formats.html"]: Refreshing state... [id=/concepts/changelogs/changelog-formats.html]
aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-changelog-formats.html"]: Refreshing state... [id=/start/tutorials/mongodb/mongodb-changelog-formats.html]
aws_s3_object.redirects["/commands/community/tag.html"]: Refreshing state... [id=/commands/community/tag.html]
aws_s3_object.redirects["/change-types/pro/drop-synonym.html"]: Refreshing state... [id=/change-types/pro/drop-synonym.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql-linux-macos.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql-linux-macos.html]
aws_s3_object.redirects["/commands/history.html"]: Refreshing state... [id=/commands/history.html]
aws_s3_object.redirects["/feature-flags/readmes/FF4J Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/FF4J Feature Flags Extension.html]
aws_s3_object.redirects["/concepts/include.html"]: Refreshing state... [id=/concepts/include.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/user.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/user.html]
aws_s3_object.redirects["/s3"]: Refreshing state... [id=/s3]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/home.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/home.html]
aws_s3_object.redirects["/commands/maintenance/drop-all.html"]: Refreshing state... [id=/commands/maintenance/drop-all.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro.html]
aws_s3_object.redirects["/commands/community/diff-json.html"]: Refreshing state... [id=/commands/community/diff-json.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cockroachdb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cockroachdb.html]
aws_s3_object.redirects["/concepts/changelogs/includeall.html"]: Refreshing state... [id=/concepts/changelogs/includeall.html]
aws_s3_object.redirects["/start/tutorials/postgresql/google-cloud-sql.html"]: Refreshing state... [id=/start/tutorials/postgresql/google-cloud-sql.html]
aws_s3_object.redirects["/databasechangeloghistory"]: Refreshing state... [id=/databasechangeloghistory]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/operations.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/operations.html]
aws_s3_object.redirects["/commands/community/diffchangelog.html"]: Refreshing state... [id=/commands/community/diffchangelog.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync-to-tag-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync-to-tag-sql.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/diffdatabase.html"]: Refreshing state... [id=/tools-integrations/ant/commands/diffdatabase.html]
aws_s3_object.redirects["/start/tutorials/cosmosdb.html"]: Refreshing state... [id=/start/tutorials/cosmosdb.html]
aws_s3_object.redirects["/start/install/tutorials/sqlite.html"]: Refreshing state... [id=/start/install/tutorials/sqlite.html]
aws_s3_object.redirects["/commands/config-ref/outputfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/outputfile-parameter.html]
aws_s3_object.redirects["/concepts/changes/home.html"]: Refreshing state... [id=/concepts/changes/home.html]
aws_s3_object.redirects["/install/liquibase-downloaded-files.html"]: Refreshing state... [id=/install/liquibase-downloaded-files.html]
aws_s3_object.redirects["/start/install/tutorials/voltdb.html"]: Refreshing state... [id=/start/install/tutorials/voltdb.html]
aws_s3_object.redirects["/commands/quality-checks/lab-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/lab-quality-checks.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollbackOneChangeSet.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollbackOneChangeSet.html]
aws_s3_object.redirects["/commands/config-ref/liquibase-catalog-name-parameter.html"]: Refreshing state... [id=/commands/config-ref/liquibase-catalog-name-parameter.html]
aws_s3_object.redirects["/start/tutorials/vertica.html"]: Refreshing state... [id=/start/tutorials/vertica.html]
aws_s3_object.redirects["/concepts/labels.html"]: Refreshing state... [id=/concepts/labels.html]
aws_s3_object.redirects["/concepts/changelogs/structure-changelogs.html"]: Refreshing state... [id=/concepts/changelogs/structure-changelogs.html]
aws_s3_object.redirects["/what-is-a-jdbc-url.html"]: Refreshing state... [id=/what-is-a-jdbc-url.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.23.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.23.1.html]
aws_s3_object.redirects["/change-types/community/stop.html"]: Refreshing state... [id=/change-types/community/stop.html]
aws_s3_object.redirects["/change-types/pro/enable-trigger.html"]: Refreshing state... [id=/change-types/pro/enable-trigger.html]
aws_s3_object.redirects["/xml/ns/dbchangelog/"]: Refreshing state... [id=/xml/ns/dbchangelog/]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-revoke-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-revoke-warn.html]
aws_s3_object.redirects["/commands/quality-checks/checks/modify-data-type-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/modify-data-type-warn.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/changelog-attributes.html"]: Refreshing state... [id=/concepts/changelogs/attributes/changelog-attributes.html]
aws_s3_object.redirects["/install/tutorials/vertica.html"]: Refreshing state... [id=/install/tutorials/vertica.html]
aws_s3_object.redirects["/change-types/pro/mark-unused.html"]: Refreshing state... [id=/change-types/pro/mark-unused.html]
aws_s3_object.redirects["/start/release-notes/mongodb-extension-release-notes.html"]: Refreshing state... [id=/start/release-notes/mongodb-extension-release-notes.html]
aws_s3_object.redirects["/operation-reports.html"]: Refreshing state... [id=/operation-reports.html]
aws_s3_object.redirects["/concepts/installation/running-first-update-installer.html"]: Refreshing state... [id=/concepts/installation/running-first-update-installer.html]
aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/object-name-must-not-match.html]
aws_s3_object.redirects["/workflows/liquibase-community/liquibase-auto-rollback.html"]: Refreshing state... [id=/workflows/liquibase-community/liquibase-auto-rollback.html]
aws_s3_object.redirects["/tools-integrations/observability/database-reports.html"]: Refreshing state... [id=/tools-integrations/observability/database-reports.html]
aws_s3_object.redirects["/start/install/tutorials/enterprisedb.html"]: Refreshing state... [id=/start/install/tutorials/enterprisedb.html]
aws_s3_object.redirects["/commands/futurerollbacksql.html"]: Refreshing state... [id=/commands/futurerollbacksql.html]
aws_s3_object.redirects["/commands/community/futurerollbacksql.html"]: Refreshing state... [id=/commands/community/futurerollbacksql.html]
aws_s3_object.redirects["/drift-reports.html"]: Refreshing state... [id=/drift-reports.html]
aws_s3_object.redirects["/documentation/labels.html"]: Refreshing state... [id=/documentation/labels.html]
aws_s3_object.redirects["/commands/rollbackcount.html"]: Refreshing state... [id=/commands/rollbackcount.html]
aws_s3_object.redirects["/concepts/advanced/should-snapshot-data-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-snapshot-data-parameter.html]
aws_s3_object.redirects["/concepts/advanced/include-catalog-in-specification-parameter.html"]: Refreshing state... [id=/concepts/advanced/include-catalog-in-specification-parameter.html]
aws_s3_object.redirects["/concepts/changes/drop_table.html"]: Refreshing state... [id=/concepts/changes/drop_table.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-linux.html]
aws_s3_object.redirects["/tools-integrations/cli/home.html"]: Refreshing state... [id=/tools-integrations/cli/home.html]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-list.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-list.html]
aws_s3_object.redirects["/commands/rollbackonechangesetsql.html"]: Refreshing state... [id=/commands/rollbackonechangesetsql.html]
aws_s3_object.redirects["/change-types/community/insert.html"]: Refreshing state... [id=/change-types/community/insert.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/popular-topics.html"]: Refreshing state... [id=/tools-integrations/maven/commands/popular-topics.html]
aws_s3_object.redirects["/commands/updatecount.html"]: Refreshing state... [id=/commands/updatecount.html]
aws_s3_object.redirects["/start/tutorials/sap-adaptive-server-enterprise-sap-ase.html"]: Refreshing state... [id=/start/tutorials/sap-adaptive-server-enterprise-sap-ase.html]
aws_s3_object.redirects["/commands/pro/rollbackonechangeset.html"]: Refreshing state... [id=/commands/pro/rollbackonechangeset.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/use-sql-plus-integration.html]
aws_s3_object.redirects["/start/tutorials/hibernate.html"]: Refreshing state... [id=/start/tutorials/hibernate.html]
aws_s3_object.redirects["/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html"]: Refreshing state... [id=/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-register-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-register-changelog.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-sync-hub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-sync-hub.html]
aws_s3_object.redirects["/commands/updatetotag.html"]: Refreshing state... [id=/commands/updatetotag.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.9.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.9.0.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/gitlab-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/gitlab-feature-flags-extension.html]
aws_s3_object.redirects["/concepts/advanced/logicalfilepath.html"]: Refreshing state... [id=/concepts/advanced/logicalfilepath.html]
aws_s3_object.redirects["/concepts/advanced/runonchange.html"]: Refreshing state... [id=/concepts/advanced/runonchange.html]
aws_s3_object.redirects["/commands/quality-checks/getting-started-with-the-checks-command.html"]: Refreshing state... [id=/commands/quality-checks/getting-started-with-the-checks-command.html]
aws_s3_object.redirects["/commands/community/dbdoc.html"]: Refreshing state... [id=/commands/community/dbdoc.html]
aws_s3_object.redirects["/commands/liquibase-start/home.html"]: Refreshing state... [id=/commands/liquibase-start/home.html]
aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongodb/mongodb-atlas-config.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/2014/11/faq.html"]: Refreshing state... [id=/2014/11/faq.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.3-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.3-upgrade-guide.html]
aws_s3_object.redirects["/concepts/basic/changeset.html"]: Refreshing state... [id=/concepts/basic/changeset.html]
aws_s3_object.redirects["/commands/community/rollbacktodatesql.html"]: Refreshing state... [id=/commands/community/rollbacktodatesql.html]
aws_s3_object.redirects["/commands/community/registerChangeLog.html"]: Refreshing state... [id=/commands/community/registerChangeLog.html]
aws_s3_object.redirects["/concepts/advanced/include.html"]: Refreshing state... [id=/concepts/advanced/include.html]
aws_s3_object.redirects["/command-line/index.html"]: Refreshing state... [id=/command-line/index.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/flipt-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/flipt-feature-flags-extension.html]
aws_s3_object.redirects["/change-types/community/drop-all-foreign-key-constraints.html"]: Refreshing state... [id=/change-types/community/drop-all-foreign-key-constraints.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-listLocks.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-listLocks.html]
aws_s3_object.redirects["/install/liquibase-linux.html"]: Refreshing state... [id=/install/liquibase-linux.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/apache-derby.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/apache-derby.html]
aws_s3_object.redirects["/concepts/changelog-parameters.html"]: Refreshing state... [id=/concepts/changelog-parameters.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-pro-certified-databases.html"]: Refreshing state... [id=/concepts/advanced/liquibase-pro-certified-databases.html]
aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-community-enterprise-server.html"]: Refreshing state... [id=/start/tutorials/mongodb/mongodb-pro-community-enterprise-server.html]
aws_s3_object.redirects["/feature-flags/readmes/Flagsmith Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Flagsmith Feature Flags Extension.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-sql-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-sql-on-linux-macos.html]
aws_s3_object.redirects["/install/tutorials/cockroachdb.html"]: Refreshing state... [id=/install/tutorials/cockroachdb.html]
aws_s3_object.redirects["/tools-integrations/community-supported/cdi.html"]: Refreshing state... [id=/tools-integrations/community-supported/cdi.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra-astra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra-astra.html]
aws_s3_object.redirects["/concepts/changes/index.html"]: Refreshing state... [id=/concepts/changes/index.html]
aws_s3_object.redirects["/commands/maintenance/clear-checksums.html"]: Refreshing state... [id=/commands/maintenance/clear-checksums.html]
aws_s3_object.redirects["/concepts/basic/java-opts-environment-variable.html"]: Refreshing state... [id=/concepts/basic/java-opts-environment-variable.html]
aws_s3_object.redirects["/commands/maintenance/list-locks.html"]: Refreshing state... [id=/commands/maintenance/list-locks.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-4.0-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-4.0-upgrade-guide.html]
aws_s3_object.redirects["/concepts/advanced/includeall.html"]: Refreshing state... [id=/concepts/advanced/includeall.html]
aws_s3_object.redirects["/commands/liquibase-start/init-start-h2.html"]: Refreshing state... [id=/commands/liquibase-start/init-start-h2.html]
aws_s3_object.redirects["/start/tutorials/interbase.html"]: Refreshing state... [id=/start/tutorials/interbase.html]
aws_s3_object.redirects["/start/install/tutorials/postgresql.html"]: Refreshing state... [id=/start/install/tutorials/postgresql.html]
aws_s3_object.redirects["/commands/pro/checks-bulk-set.html"]: Refreshing state... [id=/commands/pro/checks-bulk-set.html]
aws_s3_object.redirects["/commands/liquibase-start/init-project.html"]: Refreshing state... [id=/commands/liquibase-start/init-project.html]
aws_s3_object.redirects["/change-types/community/drop-index.html"]: Refreshing state... [id=/change-types/community/drop-index.html]
aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/table-comment-check.html]
aws_s3_object.redirects["/concepts/xml-format.html"]: Refreshing state... [id=/concepts/xml-format.html]
aws_s3_object.redirects["/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html"]: Refreshing state... [id=/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html]
aws_s3_object.redirects["/change-types/community/drop-view.html"]: Refreshing state... [id=/change-types/community/drop-view.html]
aws_s3_object.redirects["/commands/calculatechecksum.html"]: Refreshing state... [id=/commands/calculatechecksum.html]
aws_s3_object.redirects["/commands/quality-checks/checks/table-column-limit.html"]: Refreshing state... [id=/commands/quality-checks/checks/table-column-limit.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-customize.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-customize.html]
aws_s3_object.redirects["/change-types/community/set-table-remarks.html"]: Refreshing state... [id=/change-types/community/set-table-remarks.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-generateChangeLog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-generateChangeLog.html]
aws_s3_object.redirects["/install/tutorials/hsqldb.html"]: Refreshing state... [id=/install/tutorials/hsqldb.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.21.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.21.0.html]
aws_s3_object.redirects["/concepts/databasechangelog-table.html"]: Refreshing state... [id=/concepts/databasechangelog-table.html]
aws_s3_object.redirects["/change-types/community/add-column.html"]: Refreshing state... [id=/change-types/community/add-column.html]
aws_s3_object.redirects["/DATABASECHANGELOGHISTORY"]: Refreshing state... [id=/DATABASECHANGELOGHISTORY]
aws_s3_object.redirects["/workflows/liquibase-community/setup-github-actions-workflow.html"]: Refreshing state... [id=/workflows/liquibase-community/setup-github-actions-workflow.html]
aws_s3_object.redirects["/commands/changelogsync.html"]: Refreshing state... [id=/commands/changelogsync.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mongodb"]: Refreshing state... [id=/workflows/database-setup-tutorials/mongodb]
aws_s3_object.redirects["/start/release-notes/liquibase-4.7.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.7.1.html]
aws_s3_object.redirects["/install/tutorials/cloud-spanner.html"]: Refreshing state... [id=/install/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/concepts/advanced/convert-data-types-parameter.html"]: Refreshing state... [id=/concepts/advanced/convert-data-types-parameter.html]
aws_s3_object.redirects["/commands/update/execute-sql.html"]: Refreshing state... [id=/commands/update/execute-sql.html]
aws_s3_object.redirects["/dropall"]: Refreshing state... [id=/dropall]
aws_s3_object.redirects["/concepts/basic/json-format.html"]: Refreshing state... [id=/concepts/basic/json-format.html]
aws_s3_object.redirects["/change-types/community/modify-data-type.html"]: Refreshing state... [id=/change-types/community/modify-data-type.html]
aws_s3_object.redirects["/concepts/includeall.html"]: Refreshing state... [id=/concepts/includeall.html]
aws_s3_object.redirects["/database-reports.html"]: Refreshing state... [id=/database-reports.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.21.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.21.1.html]
aws_s3_object.redirects["/parameters/objectquotingstrategy.html"]: Refreshing state... [id=/parameters/objectquotingstrategy.html]
aws_s3_object.redirects["/commands/diffchangelog.html"]: Refreshing state... [id=/commands/diffchangelog.html]
aws_s3_object.redirects["/start/tutorials/db2onz.html"]: Refreshing state... [id=/start/tutorials/db2onz.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql-linux.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-psql-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-psql-integration.html]
aws_s3_object.redirects["/commands/community/status-verbose.html"]: Refreshing state... [id=/commands/community/status-verbose.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-windows.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mssql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mssql.html]
aws_s3_object.redirects["/commands/pro/rollbackoneupdatesql.html"]: Refreshing state... [id=/commands/pro/rollbackoneupdatesql.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-liquibase-java-api.html"]: Refreshing state... [id=/workflows/liquibase-community/using-liquibase-java-api.html]
aws_s3_object.redirects["/change-types/community/rename-sequence.html"]: Refreshing state... [id=/change-types/community/rename-sequence.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-odbc-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-server-odbc-reserved-keywords.html]
aws_s3_object.redirects["/concepts/installation/lb-developer-workflow.html"]: Refreshing state... [id=/concepts/installation/lb-developer-workflow.html]
aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/database-checks/object-name-must-not-match.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-future-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-server-future-reserved-keywords.html]
aws_s3_object.redirects["/tools-integrations/remote-files/remote-file-path-rules.html"]: Refreshing state... [id=/tools-integrations/remote-files/remote-file-path-rules.html]
aws_s3_object.redirects["/commands/config-ref/diff-column-order.html"]: Refreshing state... [id=/commands/config-ref/diff-column-order.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelogSyncToTagSQL.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelogSyncToTagSQL.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/lb-3.1-upgrade-guide.html]
aws_s3_object.redirects["/commands/config-ref/output-line-separator.html"]: Refreshing state... [id=/commands/config-ref/output-line-separator.html]
aws_s3_object.redirects["/commands/quality-checks/checks/postgres-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/postgres-reserved-keywords.html]
aws_s3_object.redirects["/install/tutorials/tutorial-using-oracle.html"]: Refreshing state... [id=/install/tutorials/tutorial-using-oracle.html]
aws_s3_object.redirects["/concepts/maven/index.html"]: Refreshing state... [id=/concepts/maven/index.html]
aws_s3_object.redirects["/dropall.html"]: Refreshing state... [id=/dropall.html]
aws_s3_object.redirects["/feature-flags/readmes/Flipt Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Flipt Feature Flags Extension.html]
aws_s3_object.redirects["/install/tutorials/snowflake.html"]: Refreshing state... [id=/install/tutorials/snowflake.html]
aws_s3_object.redirects["/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html"]: Refreshing state... [id=/install/tutorials/sap-adaptive-server-enterprise-sap-ase.html]
aws_s3_object.redirects["/tools-integrations/observability/operation-reports-checks-run-report.html"]: Refreshing state... [id=/tools-integrations/observability/operation-reports-checks-run-report.html]
aws_s3_object.redirects["/commands/config-ref/include-system-classpath-parameter.html"]: Refreshing state... [id=/commands/config-ref/include-system-classpath-parameter.html]
aws_s3_object.redirects["/commands/community/changelogsync.html"]: Refreshing state... [id=/commands/community/changelogsync.html]
aws_s3_object.redirects["/commands/community/registerchangelog.html"]: Refreshing state... [id=/commands/community/registerchangelog.html]
aws_s3_object.redirects["/drift-reports"]: Refreshing state... [id=/drift-reports]
aws_s3_object.redirects["/concepts/basic/changelog-property-substitution.html"]: Refreshing state... [id=/concepts/basic/changelog-property-substitution.html]
aws_s3_object.redirects["/commands/quality-checks/checks/change-drop-column-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/change-drop-column-warn.html]
aws_s3_object.redirects["/start/tutorials/postgresql.html"]: Refreshing state... [id=/start/tutorials/postgresql.html]
aws_s3_object.redirects["/commands/maintenance/calculate-checksum.html"]: Refreshing state... [id=/commands/maintenance/calculate-checksum.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/sql-plus-troubleshoot.html"]: Refreshing state... [id=/concepts/changelogs/attributes/sql-plus-troubleshoot.html]
aws_s3_object.redirects["/start/install/tutorials/firebird.html"]: Refreshing state... [id=/start/install/tutorials/firebird.html]
aws_s3_object.redirects["/concepts/changelog.html"]: Refreshing state... [id=/concepts/changelog.html]
aws_s3_object.redirects["/databasechangeloghistory.html"]: Refreshing state... [id=/databasechangeloghistory.html]
aws_s3_object.redirects["/change-types/community/load-update-data.html"]: Refreshing state... [id=/change-types/community/load-update-data.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-update-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-update-sql.html]
aws_s3_object.redirects["/concepts/databasechangelog.html"]: Refreshing state... [id=/concepts/databasechangelog.html]
aws_s3_object.redirects["/checks-packages.html"]: Refreshing state... [id=/checks-packages.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-warn.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/growthbook-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/growthbook-feature-flags-extension.html]
aws_s3_object.redirects["/tools-integrations/remote-files/create-changelogs-s3.html"]: Refreshing state... [id=/tools-integrations/remote-files/create-changelogs-s3.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-xml-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-xml-macos.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-run.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-run.html]
aws_s3_object.redirects["/commands/updatetotagsql.html"]: Refreshing state... [id=/commands/updatetotagsql.html]
aws_s3_object.redirects["/concepts/basic/sql-format.html"]: Refreshing state... [id=/concepts/basic/sql-format.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.18.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.18.0.html]
aws_s3_object.redirects["/tools-integrations/springboot/springboot.html"]: Refreshing state... [id=/tools-integrations/springboot/springboot.html]
aws_s3_object.redirects["/commands/marknextchangesetran.html"]: Refreshing state... [id=/commands/marknextchangesetran.html]
aws_s3_object.redirects["/commands/docs/db-doc.html"]: Refreshing state... [id=/commands/docs/db-doc.html]
aws_s3_object.redirects["/commands/maintenance/mark-next-changeset-ran.html"]: Refreshing state... [id=/commands/maintenance/mark-next-changeset-ran.html]
aws_s3_object.redirects["/documentation/contexts.html"]: Refreshing state... [id=/documentation/contexts.html]
aws_s3_object.redirects["/install/tutorials/apache-derby.html"]: Refreshing state... [id=/install/tutorials/apache-derby.html]
aws_s3_object.redirects["/s3.html"]: Refreshing state... [id=/s3.html]
aws_s3_object.redirects["/concepts/advanced/logfile-parameter.html"]: Refreshing state... [id=/concepts/advanced/logfile-parameter.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-yaml-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-yaml-linux.html]
aws_s3_object.redirects["/start/tutorials/sqlite.html"]: Refreshing state... [id=/start/tutorials/sqlite.html]
aws_s3_object.redirects["/change-types/community/create-table.html"]: Refreshing state... [id=/change-types/community/create-table.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/home.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/home.html]
aws_s3_object.redirects["/parameters/object-quoting-strategy.html"]: Refreshing state... [id=/parameters/object-quoting-strategy.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.24.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.24.0.html]
aws_s3_object.redirects["/change-types/pro/home.html"]: Refreshing state... [id=/change-types/pro/home.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/changelog-elements.html"]: Refreshing state... [id=/concepts/changelogs/attributes/changelog-elements.html]
aws_s3_object.redirects["/change-types/pro/add-check-constraint.html"]: Refreshing state... [id=/change-types/pro/add-check-constraint.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra.html]
aws_s3_object.redirects["/commands/tagexists.html"]: Refreshing state... [id=/commands/tagexists.html]
aws_s3_object.redirects["/parameters/ignore.html"]: Refreshing state... [id=/parameters/ignore.html]
aws_s3_object.redirects["/start/getting-started-liquibase-xml.html"]: Refreshing state... [id=/start/getting-started-liquibase-xml.html]
aws_s3_object.redirects["/commands/config-ref/driver.html"]: Refreshing state... [id=/commands/config-ref/driver.html]
aws_s3_object.redirects["/secrets-management/aws-secrets-mgr.html"]: Refreshing state... [id=/secrets-management/aws-secrets-mgr.html]
aws_s3_object.redirects["/commands/community/rollbackcountsql.html"]: Refreshing state... [id=/commands/community/rollbackcountsql.html]
aws_s3_object.redirects["/commands/quality-checks/parameters/checks-scope.html"]: Refreshing state... [id=/commands/quality-checks/parameters/checks-scope.html]
aws_s3_object.redirects["/feature-flags/readmes/Flipt Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/Flipt Feature Flags Extension_1.html]
aws_s3_object.redirects["/concepts/changelogs/working-with-changelogs.html"]: Refreshing state... [id=/concepts/changelogs/working-with-changelogs.html]
aws_s3_object.redirects["/change-types/community/execute-command.htm"]: Refreshing state... [id=/change-types/community/execute-command.htm]
aws_s3_object.redirects["/concepts/advanced/objectquotingstrategy.html"]: Refreshing state... [id=/concepts/advanced/objectquotingstrategy.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/generatechangelog.html"]: Refreshing state... [id=/tools-integrations/ant/commands/generatechangelog.html]
aws_s3_object.redirects["/start/install/tutorials/mysql.html"]: Refreshing state... [id=/start/install/tutorials/mysql.html]
aws_s3_object.redirects["/start/install/tutorials/maxdb.html"]: Refreshing state... [id=/start/install/tutorials/maxdb.html]
aws_s3_object.redirects["/2014/11/home.html"]: Refreshing state... [id=/2014/11/home.html]
aws_s3_object.redirects["/commands/quality-checks/object-name-must-match.html"]: Refreshing state... [id=/commands/quality-checks/object-name-must-match.html]
aws_s3_object.redirects["/concepts/advanced/headless-parameter.html"]: Refreshing state... [id=/concepts/advanced/headless-parameter.html]
aws_s3_object.redirects["/commands/quality-checks/table-column-limit.html"]: Refreshing state... [id=/commands/quality-checks/table-column-limit.html]
aws_s3_object.redirects["/commands/config-ref/convert-data-types-parameter.html"]: Refreshing state... [id=/commands/config-ref/convert-data-types-parameter.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-update.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-update.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-show.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-show.html]
aws_s3_object.redirects["/concepts/advanced/configuring-quality-checks.html"]: Refreshing state... [id=/concepts/advanced/configuring-quality-checks.html]
aws_s3_object.redirects["/commands/snapshotreference.html"]: Refreshing state... [id=/commands/snapshotreference.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.8.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.8.0.html]
aws_s3_object.redirects["/start/getting-started-liquibase-xml-windows.html"]: Refreshing state... [id=/start/getting-started-liquibase-xml-windows.html]
aws_s3_object.redirects["/change-types/community/sql.html"]: Refreshing state... [id=/change-types/community/sql.html]
aws_s3_object.redirects["/install/tutorials/cosmosdb.html"]: Refreshing state... [id=/install/tutorials/cosmosdb.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hsql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hsql.html]
aws_s3_object.redirects["/install/tutorials/enterprisedb.html"]: Refreshing state... [id=/install/tutorials/enterprisedb.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/run-with.html"]: Refreshing state... [id=/concepts/changelogs/attributes/run-with.html]
aws_s3_object.redirects["/commands/config-ref/headless-parameter.html"]: Refreshing state... [id=/commands/config-ref/headless-parameter.html]
aws_s3_object.redirects["/commands/pro/rollback-one-changeset.html"]: Refreshing state... [id=/commands/pro/rollback-one-changeset.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-changeset.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-changeset.html]
aws_s3_object.redirects["/concepts/ant/index.html"]: Refreshing state... [id=/concepts/ant/index.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html]
aws_s3_object.redirects["/concepts/advanced/always-override-stored-logic-schema.html"]: Refreshing state... [id=/concepts/advanced/always-override-stored-logic-schema.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/aws-secrets-mgr.html"]: Refreshing state... [id=/tools-integrations/secrets-management/aws-secrets-mgr.html]
aws_s3_object.redirects["/start/tutorials/h2.html"]: Refreshing state... [id=/start/tutorials/h2.html]
aws_s3_object.redirects["/tools-integrations/springboot/using-springboot-sql-plus-kerberos.html"]: Refreshing state... [id=/tools-integrations/springboot/using-springboot-sql-plus-kerberos.html]
aws_s3_object.redirects["/install/tutorials/mongodb.html"]: Refreshing state... [id=/install/tutorials/mongodb.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-sql-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-sql-on-windows.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html"]: Refreshing state... [id=/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html]
aws_s3_object.redirects["/commands/change-tracking/changelog-sync-to-tag-sql.html"]: Refreshing state... [id=/commands/change-tracking/changelog-sync-to-tag-sql.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync-to-tag.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync-to-tag.html]
aws_s3_object.redirects["/tools-integrations/observability/meta-data-structured-logs.html"]: Refreshing state... [id=/tools-integrations/observability/meta-data-structured-logs.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-delete.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-delete.html]
aws_s3_object.redirects["/install/liquibase-installation-troubleshooting.html"]: Refreshing state... [id=/install/liquibase-installation-troubleshooting.html]
aws_s3_object.redirects["/start/install/tutorials/hibernate.html"]: Refreshing state... [id=/start/install/tutorials/hibernate.html]
aws_s3_object.redirects["/popular-topics.html"]: Refreshing state... [id=/popular-topics.html]
aws_s3_object.redirects["/install/tutorials/mariadb.html"]: Refreshing state... [id=/install/tutorials/mariadb.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/properties.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/properties.html]
aws_s3_object.redirects["/change-types/column.html"]: Refreshing state... [id=/change-types/column.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-linux.html]
aws_s3_object.redirects["/commands/synchub.html"]: Refreshing state... [id=/commands/synchub.html]
aws_s3_object.redirects["/start/getting-started-liquibase-xml-linux-macos.html"]: Refreshing state... [id=/start/getting-started-liquibase-xml-linux-macos.html]
aws_s3_object.redirects["/concepts/advanced/preconditions.html"]: Refreshing state... [id=/concepts/advanced/preconditions.html]
aws_s3_object.redirects["/concepts/advanced/generated-changeset-ids-contains-description.html"]: Refreshing state... [id=/concepts/advanced/generated-changeset-ids-contains-description.html]
aws_s3_object.redirects["/commands/quality-checks/checks-delete.html"]: Refreshing state... [id=/commands/quality-checks/checks-delete.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/change-types/community/execute-command.htm"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/change-types/community/execute-command.htm"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/change-types/execute-command.htm" -> "/change-types/execute-command.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/change-types/community/execute-command.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/change-types/community/execute-command.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/change-types/execute-command.html"
    }

  # aws_s3_object.redirects["/custom-policy-checks"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/custom-policy-checks"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/custom-policy-checks/home.html"
    }

  # aws_s3_object.redirects["/custom-policy-checks.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/custom-policy-checks.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/custom-policy-checks/home.html"
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/pro-extensions"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/pro-extensions"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/workflows/liquibase-pro/extensions-list.html"
    }

  # aws_s3_object.redirects["/pro-extensions.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/pro-extensions.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/workflows/liquibase-pro/extensions-list.html"
    }

Plan: 5 to add, 3 to change, 0 to destroy.

[01J3G163YH826GNEEG9MQ0RT8G] Changes are GO
[01J3G163YH826GNEEG9MQ0RT8G] Uploading the list of managed resources...
[01J3G163YH826GNEEG9MQ0RT8G] Generating Infracost JSON report from plan

[01J3G163YH826GNEEG9MQ0RT8G] Infracost report generated successfully
[01J3G163YH826GNEEG9MQ0RT8G] Mapping Infracost data to resources
[01J3G163YH826GNEEG9MQ0RT8G] Costs mapped successfully
[01J3G163YH826GNEEG9MQ0RT8G] Please be aware that the run changes calculation includes output changes.
[01J3G163YH826GNEEG9MQ0RT8G] Resource list upload is GO
[01J3G163YH826GNEEG9MQ0RT8G] Generating JSON representation of the plan...
[01J3G163YH826GNEEG9MQ0RT8G] JSON representation is GO
[01J3G163YH826GNEEG9MQ0RT8G] Generating Infracost JSON report from plan

[01J3G163YH826GNEEG9MQ0RT8G] Infracost report generated successfully
[01J3G163YH826GNEEG9MQ0RT8G] Loading custom plan policy inputs...
[01J3G163YH826GNEEG9MQ0RT8G] 0 custom plan policy inputs found
[01J3G163YH826GNEEG9MQ0RT8G] No plan policies to evaluate
```

</details>